Revit 2024 API
WorksetTable.DeleteWorkset Method
 Delete the specific workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public static void DeleteWorkset(
	Document document,
	WorksetId worksetId,
	DeleteWorksetSettings deleteWorksetSettings
)
Visual Basic
Public Shared Sub DeleteWorkset ( _
	document As Document, _
	worksetId As WorksetId, _
	deleteWorksetSettings As DeleteWorksetSettings _
)
Visual C++
public:
static void DeleteWorkset(
	Document^ document,
	WorksetId^ worksetId,
	DeleteWorksetSettings^ deleteWorksetSettings
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document containing the worksets.
worksetId
Type: Autodesk.Revit.DB.WorksetId
 The id of the workset to delete.
deleteWorksetSettings
Type: Autodesk.Revit.DB.DeleteWorksetSettings
 The settings to delete a workset.
Remarks
 Please checkout the workset before executing this method. The method may fail in some situations that mentioned in CanDeleteWorkset(Document, WorksetId, DeleteWorksetSettings). Another failure case is the Transaction failure due to "Deleting all open views in a project is not allowed."
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a workshared document. -or- document is not a primary document, it is a linked document. -or- document is read-only: It cannot be modified. -or- There is no workset in the document with this id. -or- Workset cannot be deleted.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
Autodesk.Revit.Exceptions.RegenerationFailedException |  The document regeneration fails during the DeleteWorkset operation.
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace